#pragma once
int terryBasic[15] = { 0, 195, 385, 570, 760, 945, 1135, 1320 };
int terryfMove[15] = { 0, 170, 330, 475, 610, 750, 920 };
int terrybMove[15] = { 0, 140, 280, 420, 560, 720, 900 };
int terrysHand[15] = { 0, 190, 405, 600 };
int terrybHand[15] = { 0, 190, 375, 555, 805, 1065, 1265, 1450, 1650 };
int terrysKick[15] = { 0, 200, 345, 615, 755, 970 };
int terrybKick[15] = { 0, 165, 315, 570, 825, 1075, 1290, 1440, 1640 };
int terrysHit[15] = { 0, 205, 415, 625, 825, 1030 };
int terrybHit[15] = { 0, 215, 420, 610, 780, 970 };


int terryfMove_R[15] = { 0, 175, 350, 495, 630, 780, 920 }; //리버스
int terrybMove_R[15] = { 0, 185, 340, 480, 620, 760, 900 }; //리버스
int terrysHand_R[15] = { 0, 195, 410, 600 }; //리버스
int terrybHand_R[15] = { 0, 200, 390, 590, 840, 1090, 1270, 1460, 1650 }; //리버스
int terrysKick_R[15] = { 0, 215, 355, 625, 770, 970 }; //리버스
int terrybKick_R[15] = { 0, 200, 350, 560, 810, 1065, 1320, 1470, 1640 }; //리버스
int terrysHit_R[15] = { 0, 210, 415, 615, 830, 1030 }; //리버스
int terrybHit_R[15] = { 0, 190, 360, 550, 760, 970 }; //리버스



//int terrybMove[15] = { 0, 85, 152, 217, 280, 335, 409 };	//초안 (부자연)